tests/load/app.yaml
config:
  target: "https://server-staging.api.raiinmaker.com/v1/public/graphql/"
  phases:
    - duration: 5
      arrivalRate: 50
  processor: './app.js'
  defaults:
    - headers:
      authorization: "{{ $processEnvironment.TEST_API_KEY }}"
scenarios:
  - name: 'Simulate standard app traffic'
    flow:
      - function: 'testCases'
      - loop:
          - post:
              url: '/'
              # enables response logs
              # afterResponse: "logging"
              json:
                query: '{{ $loopElement.query }}'
                variables: '{{ $loopElement.variables }}'
        over: cases